results/async_simple_tc1.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/job/async/simple
Document Length:        28 bytes

Concurrency Level:      1
Time taken for tests:   0.253 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      16100 bytes
HTML transferred:       2800 bytes
Requests per second:    395.52 [#/sec] (mean)
Time per request:       2.528 [ms] (mean)
Time per request:       2.528 [ms] (mean, across all concurrent requests)
Transfer rate:          62.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     1    2   1.3      2       9
Waiting:        1    2   1.4      1       9
Total:          1    2   1.4      2       9

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      3
  80%      3
  90%      4
  95%      6
  98%      8
  99%      9
 100%      9 (longest request)